Repository: Dima73/enigma2-plugin-extensions-xmodem
Catalog: po/*.po
Languages: ru, uk

source: 1 час
ru: xModem

source: 12 hours
ru: 12 часов

source: 15 min
ru: 15 мин

source: 2 hours
ru: 2 часа

source: 24 hours
ru: 24 часа

source: 30 min
ru: 30 мин

source: 4 hours
ru: 4 часа

source: 48 hours
ru: 48 часов

source: APN
ru: Точка входа (APN)
uk: Точка доступу(APN)

source: AT-commands
ru: AT-команды

source: Abort
ru: Прервать
uk: Зупинить

source: About plugin
ru: О плагине

source: Adv. pppd options
ru: Дополнительные pppd опции
uk: Дод. опції для pppd

source: Alternative DNS
ru: Альтернативные DNS-сервера
uk: Альтернативні DNS

source: Autorestart modem
ru: Авторестарт модема

source: Autostart modem
ru: Автостарт модема
uk: Автостарт модема

source: Bytes:
ru: Байты:
uk: Байти:

source: Cancel
ru: Отмена
uk: Відмінить

source: Close
ru: Закрыть
uk: Вихід

source: Connect
ru: Подключение
uk: З'єднати

source: Connect statistics
ru: Статистика соединения
uk: Статистика з'єднання

source: Connected :)
ru: Подключено :)
uk: Підключено :)

source: Connected!
ru: Подключено!
uk: Підключено!

source: Connection Time:
ru: Длительность соединения:
uk: Час з'єднання:

source: Connection terminated.
ru: Соединение завершено.
uk: З'єднання розірване.

source: Current Time:
ru: Текущее время:
uk: Поточний час:

source: Deinit string
ru: Строка деинициализации
uk: Рядок деініциалізації

source: Delay between attempts (sec)
ru: Задержка между попытками (сек)

source: Dialing:
ru: Соединение:
uk: З'єднання:

source: Disconnect
ru: Отключить
uk: Відключить

source: Do you really want to install the driver from the internet?
ru: Вы действительно хотите установить драйвера c интернета?

source: Errors:
ru: Ошибки:
uk: Помилки:

source: Example:'-R -c /ect/usb_modeswitch.conf' or 'usb_modeswitch -v[Vendor ID] -p[Product ID] -c /usr/share/usb_modeswitch/[Vendor ID]:[Product ID]'
ru: Пример:'-R -c /ect/usb_modeswitch.conf' или 'usb_modeswitch -v[Vendor ID] -p[Product ID] -c /usr/share/usb_modeswitch/[Vendor ID]:[Product ID]'

source: Examples_AT-commands
ru: Примеры_AT-команд

source: Extended log
ru: Расширенный лог
uk: Вести журнал з'єднання

source: Extended settings
ru: Расширенные настройки
uk: Дод.налаштування

source: Extra menu
ru: Экстра меню

source: FAILED
ru: ОШИБКА
uk: ПОМИЛКА

source: Failed start modem! Please run modem manually...
ru: Ошибка старта модема! Пожалуйста, запустите модем вручную...

source: File /etc/ppp/peers/
ru: Файл /etc/ppp/peers/
uk: Файл /etc/ppp/peers/

source: Forced auto restarting modem! Please wait...
ru: Принудительный авторестарт модема! Пожалуйста, подождите...

source: Gateway:
ru: Шлюз:
uk: Шлюз:

source: Init string
ru: Строка инициализации
uk: Рядок ініциалізації

source: Install drivers
ru: Установка драйверов

source: Install drivers for PPP
ru: Инсталляция драйверов PPP

source: Install ppp drivers from feed
ru: Установка драйверов ppp с фида

source: Instruction for utility 'picocom'
ru: Иструкция для утилиты 'picocom'

source: Interface:
ru: Интерфейс:
uk: Інтерфейс:

source: Local IP:
ru: Локальный IP:
uk: Локальний IP:

source: Log...
ru: Лог...

source: Login:
ru: Логин:
uk: Авторизація:

source: MRU size
ru: Размер MRU
uk: Розмір MRU

source: MTU size
ru: Размер MTU
uk: Розмір MTU

source: Nameservers:
ru: Сервера DNS:
uk: DNS сервера:

source: Original developer and author code (2010): vlamo Further development (2012-2015): Dimitrij
ru: Разработчик и автор оригинального кода (2010): vlamo Дальнейшая разработка (2012-2015): Dimitrij

source: Packets:
ru: Пакеты:
uk: Пакети:

source: Password
ru: Пароль
uk: Пароль

source: Persistent dialing
ru: Постоянное соединение

source: Phone number
ru: Номер набора
uk: Номер дозвону

source: Please select the necessary option...
ru: Выберите необходимое действие...

source: Please wait, install drivers...
ru: Пожалуйста, подождите - устанавливаем драйвера...

source: Plugin version: %s
ru: Версия плагина: %s

source: Port
ru: Порт
uk: Порт

source: Pppd options
ru: pppd опции
uk: Опції для pppd

source: Press left/right button to change AT-commands, e.g. switch to only the modem (tools picocom) or mode 2G only (press OK).
ru: Нажмите кнопку влево/вправо для выбора AT-команды, допустим переключить в режим только модем (используйте утилиту picocom) или режим только 2G (нажмите OK).

source: Press left/right button to change connection type.
ru: Нажмите кнопку влево/вправо для изменения стандарта подключения.
uk: Натисніть left/right кнопку, щоб змінити тип з'єднання.

source: Press left/right button to disable or enable and select extended log mode. You can view log on press TEXT button.
ru: Нажмите кнопку влево/вправо для включения/отключения и выбора режима расширенного лога. Вы можете увидеть лог по нажатию кнопки TEXT.
uk: Натисніть left/right кнопку, щоб заборонити або включити та вибрати режим ведення журналу з'єднання. Щоб подивитись журнал поточного або попереднього з'єднання натисніть кнопку TEXT.

source: Press left/right button to disable or enable firewall. The rules iptables (see /usr/lib/enigma2/python/Plugins/Extensions/xModem/5iptables-rules_up & 5iptables-rules_down) swill reject all INCOMING connections from the ppp0 interface, thus making your receiver invisible on the Internet.
ru: Включение/выключение брандмауэра. Правила iptables (см. в /usr/lib/enigma2/python/Plugins/Extensions/xModem/5iptables-rules_up & 5iptables-rules_down) отклонят все входящие соединения от интерфейса ppp0, что делает Ваш ресивер невидимым в интернете.

source: Press left/right button to enable/disable alternative DNS.
ru: Нажмите кнопку влево/вправо для включения/отключения альтернативных DNS-серверов.
uk: Натисніть left/right кнопку, щоб застосувати або заборонити використання альтернативних DNS.

source: Press left/right button to enable/disable autorun connection on start Enigma2.
ru: Нажмите кнопку влево/вправо для включения/отключения автостарта соединения с запуском Enigma2.
uk: Натисніть left/right кнопку, щоб включити або виключити автозапуск підключення на старті Enigma2 з поточними налаштуваннями.

source: Press left/right button to enable/disable extended settings.
ru: Нажмите кнопку влево/вправо для включения/отключения дополнительных настроек.
uk: Натисніть left/right кнопку, щоб включити або виключити додаткові налаштування.

source: Press left/right button to enable/disable restarting softcam and cardserver after connection modem.
ru: Нажмите кнопку влево/вправо для включения/отключения рестарта эмулятора после подключения модема.

source: Press left/right button to enable/disable usage 'usb_modeswitch' command.
ru: Нажмите кнопку влево/вправо для включения/отключения использования команд 'usb_modeswitch'.
uk: Натисніть left/right кнопку, щоб застосувати або заборонити використання 'usb_modeswitch' команди.

source: Primary DNS
ru: Первичный DNS-сервер
uk: Первинний DNS

source: Quantity failed attempts
ru: Количество неудачных попыток

source: Really close without saving settings?
ru: Действительно закрыть без сохранения настроек?

source: Really saving settings and close?
ru: Действительно сохранить настройки и закрыть плагин?

source: Received
ru: Принято
uk: Прийнято

source: Remote IP:
ru: Удалённый IP:
uk: Віддалений IP:

source: Request USSD
ru: USSD запрос

source: Restart softcam
ru: Рестарт эмулятора

source: Restart softcam (readme)
ru: Рестарт эмулятора (readme)

source: Run command 'dmesg'
ru: Выполнить команду 'dmesg'

source: Run command 'lsusb'
ru: Выполнить команду 'lsusb'

source: Run utility 'pppstats'
ru: Запуск утилиты 'pppstats'

source: Save/OK
ru: Сохранить/OK

source: Secondary DNS
ru: Вторичный DNS-сервер
uk: Вторинний DNS

source: Set AT-command as:
ru: Установить AT-команду как:

source: Set the time after which the modem will be forced automatically reconnected.
ru: Установите время, через которое модем будет принудительно автоматически переподключен.

source: Show APN list
ru: Посмотреть список APN

source: Show message before restart
ru: Показать сообщение перед рестартом

source: Show/Hide plugin xModem on extensions menu. Without restarting GUI.
ru: Показать/скрыть плагин xМодем в меню дополнений (обычно - синяя кнопка). Без рестарта GUI.

source: Show/Hide plugin xModem on mainmenu. Without restarting GUI.
ru: Показать/скрыть плагин xМодем в главном меню. Без рестарта GUI.

source: Specifies how many seconds to wait before re-initiating the link after it terminates.
ru: Указывает сколько секунд ждать перед реинициализацией канала после его закрытия. Период holdoff не применяется, если канал был закрыт по причине простоя.

source: Speed
ru: Скорость
uk: Швидкість

source: Standard
ru: Стандарт подключения
uk: Тип підключення

source: Statistics
ru: Статистика

source: Terminate after n consecutive failed connection attempts. A value of 0 means no limit.
ru: Прекратить попытки соединения после заданного числа последовательных ошибок. Значение 0 означает - без лимита.

source: Transmited
ru: Передано
uk: Передано

source: Use 'usb_modeswitch --help' command
ru: Выполнить команду 'usb_modeswitch --help'

source: Use firewall
ru: Использовать брандмауэр

source: Use number buttons on your remote control to change Access Point Name. For help contact with your mobile operator.
ru: Используйте цифровые кнопки Вашего пульта ДУ для изменения точки входа (APN). Уточняйте у Вашего оператора связи.
uk: Використовуйте цифрові кнопки, щоб задати Access Point Name. Яка повинна бути назва точки доступу, з'ясовуйте у свого мобільного оператора.

source: Use number buttons on your remote control to change Deinit string. Allowed only AT-commands (e.g.: ATH0).
ru: Используйте цифровые кнопки Вашего пульта ДУ для изменения строки деинициализации. Допускаются только AT-команды (например: ATH0).
uk: Використовуйте цифрові кнопки, щоб задати рядок деініциалізації вашого модему. Вказуйте тільки AT-команди (наприклад, ATH0).

source: Use number buttons on your remote control to change Init string. Allowed only AT-commands (e.g.: ATE1D2S0=0).
ru: Используйте цифровые кнопки Вашего пульта ДУ для изменения строки инициализации. Допускаются только AT-команды (например: ATE1D2S0=0).
uk: Використовуйте цифрові кнопки, щоб задати рядок ініциалізації вашого модему. Вказуйте тільки AT-команди (наприклад, ATE1D2S0=0).

source: Use number buttons on your remote control to change MRU size.
ru: Используйте цифровые кнопки Вашего пульта ДУ для изменения Размера MRU.
uk: Використовуйте цифрові кнопки, щоб змінити розмір MRU.

source: Use number buttons on your remote control to change MTU size.
ru: Используйте цифровые кнопки Вашего пульта ДУ для изменения Размера MTU.
uk: Використовуйте цифрові кнопки, щоб змінити розмір MTU.

source: Use number buttons on your remote control to change Primary DNS.
ru: Используйте цифровые кнопки Вашего пульта ДУ для изменения первичного DNS-сервера.
uk: Використовуйте цифрові кнопки, щоб змінити Первинний DNS.

source: Use number buttons on your remote control to change Product ID. Allowed only 4 hexdigits, without prefix '0x'. Use 'lsusb' command to get Product ID value.
ru: Используйте цифровые кнопки Вашего пульта ДУ для изменения Product ID. Допускаются только 4 знака,без префикса '0x'. Используйте команду 'lsusb' для получения значения Product ID.
uk: Використовуйте цифрові кнопки, щоб задати Product ID. Вказуйте тільки 4 hex-цифри, без префіксу '0x'. Використовуйте 'lsusb' команду, щоб дізнатись значення Product ID.

source: Use number buttons on your remote control to change Secondary DNS.
ru: Используйте цифровые кнопки Вашего пульта ДУ для изменения вторичного DNS-сервера.
uk: Використовуйте цифрові кнопки, щоб змінити Вторинний DNS.

source: Use number buttons on your remote control to change Vendor ID. Allowed only 4 hexdigits, without prefix '0x'. Use 'lsusb' command to get Vendor ID value.
ru: Используйте цифровые кнопки Вашего пульта ДУ для изменения Vendor ID. Допускаются только 4 знака, без префикса '0x'. Используйте команду 'lsusb' для получения значения Vendor ID.
uk: Використовуйте цифрові кнопки, щоб задати Vendor ID. Вказуйте тільки 4 hex-цифри, без префіксу '0x'. Використовуйте 'lsusb' команду, щоб дізнатись значення Vendor ID.

source: Use number buttons on your remote control to change advanced pppd options. For help see pppd documentation...
ru: Используйте цифровые кнопки Вашего пульта ДУ для изменения дополнительных pppd опций. Уточняйте в документации pppd...
uk: Використовуйте цифрові кнопки, щоб змінити додаткові опції для pppd. За допомогою звертайтесь до документації по pppd...

source: Use number buttons on your remote control to change dial-up number. For help contact with your mobile operator.
ru: Используйте цифровые кнопки Вашего пульта ДУ для изменения номера набора. Уточняйте у Вашего оператора связи.
uk: Використовуйте цифрові кнопки, щоб змінити номер дозвону. Який повинен бути номер, з'ясовуйте у свого мобільного оператора.

source: Use number buttons on your remote control to change login for internet access. For help contact with your mobile operator.
ru: Используйте цифровые кнопки Вашего пульта ДУ для изменения логина доступа к интернету. Уточняйте у Вашего оператора связи.
uk: Використовуйте цифрові кнопки, щоб змінити логін для доступу до Інтернету. Який повинен бути логін, з'ясовуйте у свого мобільного оператора.

source: Use number buttons on your remote control to change modem port. Use 'dmesg' command to get device path your modems.
ru: Используйте цифровые кнопки Вашего пульта ДУ для изменения порта модема. Используйте команду 'dmesg' для нахождения точки установки Вашего модема.
uk: Використовуйте цифрові кнопки, щоб змінити порт модему. Використовуйте 'dmesg' команду, щоб дізнатись device-шлях до вашого модему.

source: Use number buttons on your remote control to change password for internet access. For help contact with your mobile operator.
ru: Используйте цифровые кнопки Вашего пульта ДУ для изменения пароля доступа к интернету. Уточняйте у Вашего оператора связи.
uk: Використовуйте цифрові кнопки, щоб змінити пароль для доступу до Інтернету. Який повинен бути пароль, з'ясовуйте у свого мобільного оператора.

source: Use number buttons on your remote control to change speed of modem port.
ru: Используйте цифровые кнопки Вашего пульта ДУ для изменения скорости порта модема.
uk: Використовуйте цифрові кнопки, щоб змінити швидкість порту вашого модему.

source: Use number buttons on your remote control to set peers file. Allowed only filename of the files located into /etc/ppp/peers directory.
ru: Используйте цифровые кнопки Вашего пульта ДУ для установки Файла peers. Допускается только имя файла расположенного в директории /etc/ppp/peers.
uk: Використовуйте цифрові кнопки, щоб задати peers файл. Вказуйте тільки назву файлу, який повинен знаходитись в /etc/ppp/peers директорії.

source: Use number buttons on your remote control to set usb_modeswitch parameters. For help see usb_modeswitch documentation or use 'usb_modeswitch --help' command.
ru: Используйте цифровые кнопки Вашего пульта ДУ для изменения параметров usb_modeswitch. Уточняйте в документации или используйте команду 'usb_modeswitch --help'.

source: Use usb_modeswitch
ru: Использовать usb_modeswitch
uk: Потрібен usb_modeswitch

source: User script '10user_emurestart' for restarting softcam after connection modem need add to /usr/lib/enigma2/python/Plugins/Extensions/xModem
ru: Пользовательский скрипт '10user_emurestart' для рестарта эмулятора после подключения модема, необходимо добавить в /usr/lib/enigma2/python/Plugins/Extensions/xModem

source: Username
ru: Имя пользователя
uk: Логін

source: When enabled, do not exit after a connection is terminated, instead try to reopen the connection.
ru: Если включено, не завершаться сразу после разрыва соединения, а попытаться установить его заново.

source: When enabled, show display notification (timeout 15 sec.) before forced restart modem. Only use live tv.
ru: Если включено, то будет показано предупреждение на экране (таймаут 15 сек.), перед рестартом модема. Только в режиме live тв.

source: ZeroCD params
ru: Параметры ZeroCD
uk: Параметри ZeroCD

source: disabled
ru: отключено

source: enabled
ru: включено

source: execute
ru: выполнение...

source: full
ru: полный
uk: повний

source: full and timestamp
ru: полный с временными подробностями
uk: повний, за часом

source: internal modem
ru: внутренний модем
uk: внутрішній модем

source: none
ru: ничего
uk: ні

source: plugin to connect to internet
ru: плагин подключения к интернету
uk: Плагін для з'эднання з Інтернетом

source: short
ru: короткий
uk: стислий

source: short and timestamp
ru: короткий с временными подробностями
uk: стислий, за часом

source: usb_modeswitch params
ru: Параметры usb_modeswitch
uk: Дод.параметри для usb_modeswitch

source: use peers file
ru: использовать peers file
uk: використати peers-файл

source: xModem Connection Log...
ru: Лог подключения xModem...
uk: xModem журнал з'эднання...

source: xModem on extensions menu
ru: xModem в меню дополнений

source: xModem on mainmenu
ru: xModem в главном меню

source: xModem setup
ru: Настройки xModem

source: /etc/ppp/peers/
uk: Файл /etc/ppp/peers/

source: Product ID
uk: Продукт ID

source: Use number buttons on your remote control to set usb_modeswitch parameters. For help see usb_modeswitch documentation or use 'usb_modeswitch --help' command.
uk: Використовуйте цифрові кнопки, щоб налаштувати додаткові параметри для usb_modeswitch. За допомогою звертайтесь до документації по usb_modeswitch або виконайте команду 'usb_modeswitch --help'.

source: Vendor ID
uk: Вендор ID
